<!DOCTYPE html>
<html lang="ES">
    <!-- Cabecera -->
    <head>
        <meta charset="UTF8">
        <!-- icono -->
        <link rel="icon" href="../imagenes/favi.png" type="image/png" />
        <!-- titulo -->
        <title> Desarrollo Web: Frameworks </title>
        <!-- CSS -->
        <link rel="stylesheet" href="../estilos/style.css">        
    </head>

    <!-- Cuerpo -->
    <body bgcolor="lemonchiffon">
        <!-- Enlace al top de la pagina -->
        <a name="top"></a>
        <!-- flecha volver al top -->
        <a href="#top">
            <img class="subir" src="../imagenes/flecha.png" alt="volver arriba">
        </a>

        <!-- Menu superior -->
        <nav id="header">
            <ul class="menu">
                <li><a href = "../index.html"> Inicio </a></li>
                <li><a href = "frameworks.html"> D.W. Frameworks </a></li>
                <li><a href = "../juegos/juegos.html"> D.W. Juegos </a></li>
                <li><a href = "../boostrap/boostrap.html"> Boostrap </a></li>
                <li><a href = "../jquery/jquery.html"> JQuery </a></li>
            </ul>
        </nav>

        <!-- Contenido de la pagina -->
        <div class="contenido">
            </br>
            <h1 align="center">
                <em>Desarrollo Web: Frameworks</em>
            </h1>
            <a name="intro"></a>
            </br>
            <h2>
                <em>
                    Introducci&oacute;n
                </em>
            </h2>
            <p>  
                El uso de frameworks es una de las t&eacute;cnicas m&aacute;s usadas por los programadores para el desarrollo web. No es para menos, pues este tipo de 
                software brinda un sinf&iacute;n de facilidades para centrarse en la l&oacute;gica del funcionamiento de un sitio web, en lugar de gastar el tiempo en 
                la escritura de c&oacute;digos que se pueden reutilizar.
            </p>
            <p>
                Se trata de soluciones vers&aacute;tiles y funcionales que han facilitado la tarea de la programaci&oacute;n de sitios web, ya que se trabajan en m&oacute;dulos 
                que ayudan al desarrollador para que sea m&aacute;s &aacute;gil la configuraci&oacute;n de funciones y bloques dentro de una p&aacute;gina web.
            </p>
            <p>            
                Y es que un framework va mucho m&aacute;s all&aacute; de una librer&iacute;a de interfaz de usuarios. Aqu&iacute; vamos a ver en qu&eacute; consiste, cu&aacute;les son los m&aacute;s populares 
                en el mundo de la programaci&oacute;n web, para que elijas el m&aacute;s adecuado para ti.       
            </p>
            <a name="frameworks"></a>
            </br>
            <h2>
                <em>
                    Que son los Frameworks?
                </em>
            </h2>
            <p>
                Un framework es un software con un conjunto de componentes personalizables y reutilizables para construir y mantener un sitio web. Su nombre viene 
                del ingl&eacute;s, que en español significa «estructura», y se refiere a la base que brinda para el desarrollo web. En &eacute;l hay librer&iacute;as, extensiones, plugins 
                y dem&aacute;s funcionalidades.
            </p>
            <p>
                La mayor ventaja que ofrece un framework es que disminuye los intentos de prueba y error para comprobar el funcionamiento de un c&oacute;digo. Asimismo, 
                permite que estos no se repitan; y al contar con plantillas hace m&aacute;s f&aacute;cil la organizaci&oacute;n de los m&oacute;dulos web.
            </p>
            <p>
                Adem&aacute;s, la gran mayor&iacute;a de los frameworks que se encuentran en el mercado brindan una seguridad web a prueba de ataques de seguridad o de robo de datos.
            </p>
            <a name="destacados"></a>
            <br>
            <h2>
                <em>
                    Frameworks destacados
                </em>
            </h2>
            <p>
                <ol>
                    <li>
                        Angular
                    </li>
                    <li>
                        Laravel
                    </li>
                    <li>
                        Symfony
                    </li>
                    <li>
                        Django
                    </li>
                    <li>
                        Phalcon
                    </li>
                    <li>
                        Spring Framework
                    </li>
                    <li>
                        Express JS
                    </li>
                    <li>
                        Struts
                    </li>
                    <li>
                        Zend
                    </li>
                </ol>
            </p>

            <h4>
                1. Angular
            </h4>
                <img src="imagenes/angular.png" alt="angular" class="fizq">
            <p>
                Este framework est&aacute; basado en el lenguaje JavaScript y desarrollado en TypeScript por los programadores de Google. Es ideal para implementar una gran 
                cantidad de scripts para diferentes funciones en un sitio web; por ejemplo, se emplea mucho para crear men&uacute;s animados. Usa la arquitectura
                Modelo-Vista-Controlador (MVC), con un enlazamiento bidireccional de datos entre HTML y JavaScript.
            </p>
            <p>
                Cuenta con una comunidad bastante amplia y una gran documentaci&oacute;n. Est&aacute; en constante actualizaci&oacute;n, por lo que el uso de Angular para el desarrollo 
                web de tu sitio es una apuesta segura. 
            </p>
            </br>
            <h4>
                2. Laravel
            </h4>
            <img src="imagenes/Laravel.png" alt="Laravel" class="fdcha">
            <p>
                Nos encontramos ante uno de los frameworks m&aacute;s usados por los desarrolladores web en el mundo. Laravel ofrece una estructura bastante moderna con 
                utilidades potentes para crear una aplicaci&oacute;n web de alto nivel. La calidad de su c&oacute;digo es robusta, permite una f&aacute;cil escalabilidad de los proyectos 
                y un mantenimiento sencillo.
            </p>
            <p>
                Sus nuevas versiones traen consigo varias mejoras y funciones novedosas que aseguran un desarrollo web sumamente avanzado.
            </p>
            </br>
            <h4>
                3. Symfony
            </h4>
            <img src="imagenes/Symphony.png" alt="Symfony" class="fizq">
            <p>
                En marcha desde el 2005, Symfony es una herramienta sumamente &uacute;til para crear aplicaciones web en PHP de c&oacute;digo abierto, que se usa mucho en Europa. 
                Asimismo, tiene licencia MIT, lo que hace posible su modificaci&oacute;n. Cuenta con un gran cat&aacute;logo de plantillas para desarrollar sitios web y es muy 
                vers&aacute;til para todo tipo de proyectos: desde sencillas web hasta aplicaciones de alto desempeño.
            </p>
            <p>
                Tambi&eacute;n est&aacute; basada en el patr&oacute;n Modelo-Vista-Controlador (MVC); es compatible con gran cantidad de gestores de bases de datos y con todos los sistemas 
                operativos. Es uno de los frameworks m&aacute;s f&aacute;ciles de instalar y de usar. 
            </p>
            </br>
            <h4>
                4. Django
            </h4>
            <img src="imagenes/Django.png" alt="Django" class="fdcha">
            <p>
                Para un desarrollo profesional, &aacute;gil y seguro est&aacute; Django. Cuenta con un gran acervo de documentaci&oacute;n para dominarlo al ciento por ciento, adem&aacute;s de 
                tener una comunidad activa y cooperativa. Sirve para construir cualquier tipo de proyecto web y refleja el contenido en gran variedad de formatos como 
                el RSS feeds, XML, HTML, entre otros. 
            </p>
            <p>
                Es importante destacar que emplea lenguaje Python, es de c&oacute;digo abierto y su uso es totalmente gratuito. Un dato curioso es que fue nombrado as&iacute; en honor 
                al guitarrista Django Reinhardt.
            </p>
            </br>
            <h4>
                5. Phalcon
            </h4>
            <img src="imagenes/phalcon.png" alt="Phalcon" class="fizq">
            <p>
                Phalcon es de c&oacute;digo abierto para PHP con extensi&oacute;n C. Brinda las herramientas necesarias para construir aplicaciones web de alto nivel con el m&iacute;nimo 
                consumo de recursos para lograr un rendimiento r&aacute;pido. Adem&aacute;s de una ejecuci&oacute;n veloz, tiene una oportuna gesti&oacute;n de activos, seguridad &oacute;ptima, un pr&aacute;ctico 
                cargador universal autom&aacute;tico y una memoria eficiente.
            </p>
            <p>
                Su diseño de arquitectura es el Modelo-Vista-Controlador (MVC) y da lugar a aplicaciones web de alta configuraci&oacute;n. Es de f&aacute;cil instalaci&oacute;n, cuenta con un 
                apartado en la plataforma de GitHub para resolver dudas y consultar colaboraciones al c&oacute;digo.
            </p>
            </br>
            <h4>
                6. Spring Framework
            </h4>
            <img src="imagenes/spring.png" alt="Spring" class="fdcha">
            <p>
                Fue sacado al p&uacute;blico en el 2003 con la licencia de Apache 2.0 y es el pionero de los frameworks de Java, actualmente es una de las plataformas m&aacute;s populares 
                en el desarrollo web empresarial. A trav&eacute;s de Spring Framework es posible crear un c&oacute;digo de alto nivel, &aacute;gil y que se puede reutilizar. 
            </p>
            <p>
                Una de sus caracter&iacute;sticas m&aacute;s destacables es la inyecci&oacute;n de dependencias, la cual permite la uni&oacute;n, el mantenimiento y la reutilizaci&oacute;n de clases complejas. 
                Se basa en la arquitectura Modelo-Vista-Controlador (MVC). Cuenta con acceso de datos, gesti&oacute;n de transacciones, pruebas, procesamiento por lotes, entre otras 
                funciones avanzadas. 
            </p>
            </br>
            <h4>
                7. Express JS
            </h4>
            <img src="imagenes/expressjs.png" alt="Express JS" class="fizq">
            <p>
                Este framework est&aacute; escrito en JavaScript de c&oacute;digo abierto y es totalmente gratuito; est&aacute; considerado como uno de los m&aacute;s populares. Una de sus ventajas 
                m&aacute;s sobresalientes es que permite desarrollar el frontend y el backend utilizando un solo lenguaje, por lo que la construcci&oacute;n de aplicaciones web es muy 
                r&aacute;pida en comparaci&oacute;n con otras plataformas. 
            </p>
            <p>
                A su vez, hace posible la integraci&oacute;n de middleware y servicios externos de forma sencilla. Entre otras caracter&iacute;sticas est&aacute;n sus vistas din&aacute;micas, vistas 
                a nivel de aplicaci&oacute;n, enrutamiento de m&uacute;ltiple petici&oacute;n y negociaciones de contenido y flash. 
            </p>
            </br>
            <h4>
                8. Struts
            </h4>
            <img src="imagenes/struts.png" alt="Struts" class="fdcha">
            <p>
                Tambi&eacute;n conocida hoy en d&iacute;a como Apache Struts, es un framework de c&oacute;digo abierto y libre para el desarrollo de aplicaciones de empresa multinivel, con 
                especificaciones Java 2 Platform Enterprise Edition (J2EE). Simplifica el trabajo con sus tres componentes principales: manejador de petici&oacute;n, manejador 
                de respuesta y librer&iacute;a de tags.
            </p>
            <p>
                Precisamente la interfaz se crea de manera f&aacute;cil a partir de los tags predefinidos. Tiene una arquitectura de software Modelo-Vista-Controlador (MVC). Es 
                bastante confiable ya que lleva m&aacute;s de 20 años de constante mejoramiento y evoluci&oacute;n.
            </p>
            </br>
            <h4>
                9. Zend
            </h4>
            <img src="imagenes/zend.png" alt="Zend" class="fizq">
            <p>
                Dicho framework sirve para aplicaciones y servicios web, es de c&oacute;digo abierto y est&aacute; basado en PHP. Posee una total orientaci&oacute;n a objetos: la estructura 
                de sus componentes permite manejarlos por separado en un diseño de uso a voluntad. 
            </p>
            <p>
                Ofrece un gran rendimiento, una estable escalabilidad, una base de datos f&aacute;cil de administrar, componentes de formularios y m&aacute;s. Asimismo, cuenta con una 
                actualizaci&oacute;n constante que brinda un gran apoyo a los desarrolladores web.
            </p>
            <a name="elegir"></a>
            </br>
            <h2>
                <em>
                    Qu&eacute; Framework elegir?
                </em>
            </h2>
            <p>
                Sabemos que de la elecci&oacute;n de un buen framework depender&aacute; el correcto funcionamiento y rendimiento de tu aplicaci&oacute;n web. Es de vital importancia, porque ello 
                determinar&aacute; si tu proyecto es compatible, mantenible y estable. As&iacute; que para seleccionar el mejor, lo primero es establecer la naturaleza de tu proyecto. 
                Existen cuatro tipos principales:
            </p>
            <p class="desc">
                <b>Para usuarios.</b> Lo que buscan es una aplicaci&oacute;n web que brinde una experiencia satisfactoria con aspectos como una alta velocidad de carga y respuesta de los 
                servidores. As&iacute; que cualquier framework que trabaje con lenguaje JavaScript es &uacute;til para este prop&oacute;sito; una buena opci&oacute;n es el Struts.
            </p>
            <p class="desc">
                <b>Para archivos multimedia.</b> Espec&iacute;ficamente para sitios web que incluyan contenido de imagen, video, audio y m&aacute;s formatos de alto peso o carga. En este caso 
                requieres un framework especializado y avanzado, como Django.
            </p>
            <p class="desc">
                <b>Para gesti&oacute;n de contenido.</b> Si lo que quieres es implementar un programa de gesti&oacute;n de contenido personalizado (CMS) en tu aplicaci&oacute;n web, lo m&aacute;s adecuado 
                es que uses un framework con una &aacute;gil base de datos como la que tiene Spring Framework.
            </p>
            <p class="desc">
                <b>Para aplicaci&oacute;n web y m&oacute;vil.</b> En caso de que desees una aplicaci&oacute;n web que tambi&eacute;n sea adaptable a la vista m&oacute;vil, lo m&aacute;s recomendable es un framework que 
                use un lenguaje PHP, como el Symfony.
            </p>
            <p>
                Es importante decir que no solo puedes elegir un tipo de aplicaci&oacute;n web, pues muchos de los frameworks que mencionamos anteriormente cuentan con toda la 
                capacidad para sincronizar diferentes funciones. Sin embargo, s&iacute; es importante que tengas en cuenta cu&aacute;l es el prop&oacute;sito principal de tu web, de acuerdo 
                con tus objetivos de negocio, para seleccionar el framework ideal y aprovecharlo al m&aacute;ximo.
            </p>    
        </div>
    
        <!-- Barra lateral izquierda -->
        <aside class="barizq">
            <span class="titulillo">
                Contenido
            </span>
            <ul>
                <li>
                    <a href="#intro">Introducci&oacute;n</a>       
                </li>
                <li>
                    <a href="#frameworks">Que son los Frameworks?</a>       
                </li>
                <li>
                    <a href="#destacados">Frameworks destacados</a>       
                </li>
                <li>
                    <a href="#elegir">Qu&eacute; Framework elegir?</a>       
                </li>
            </ul>
        </aside>
    </body>
</html>